#Напишите программу, которая найдёт произведение пар чисел списка. 
#Парой считаем первый и последний элемент, второй и предпоследний и т.д.

list_1 = [1 , 2, 3, 7,8,9,12,15,12,14]
list_2=[]
for i in range(len(list_1)//2):
    list_2.append(list_1[i]+list_1[-(i+1)])
print(list_2)