#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
number=int(input("Введите десятичное число: "))
print(f'Заданное число в двоичной системе исчисления:{bin(number)}')
